#### Terraform Workspace 🛠️`vglab`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/bastion-vglab/runs/run-22DCfhxkQHUwY7jc

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.openstack_networking_network_v2.bastion: Reading...
openstack_compute_keypair_v2.bastion: Refreshing state... [id=smslab-bastion]
openstack_networking_secgroup_v2.bastion: Refreshing state... [id=50e144a0-5de5-4ac2-b72c-4c8b3b9bf111]
openstack_networking_secgroup_rule_v2.icmp: Refreshing state... [id=684745e3-860a-490a-8caa-acc1e2751907]
openstack_networking_secgroup_rule_v2.ssh: Refreshing state... [id=a2d17ece-3320-47a3-a91e-e2f127589def]
data.openstack_networking_network_v2.bastion: Read complete after 1s [id=e2b9e59f-43da-4e1c-b558-dc9da4c0d738]
openstack_networking_port_v2.bastion: Refreshing state... [id=96653605-49d7-4121-bbeb-7c9acfd52e01]
openstack_networking_floatingip_associate_v2.bastion: Refreshing state... [id=7add4753-66f1-4edb-ac65-489aa92400db]
openstack_compute_instance_v2.bastion: Refreshing state... [id=70958c53-1c25-4867-9329-64e55c51a8cb]
null_resource.sudoers["axel"]: Refreshing state... [id=7826361984937545917]
null_resource.sudoers["piotr"]: Refreshing state... [id=6132346950518648285]
null_resource.host-key: Refreshing state... [id=2132627926411471331]
null_resource.sudoers["stig"]: Refreshing state... [id=5220234943015815482]
null_resource.sudoers["bartosz"]: Refreshing state... [id=1126118696422457585]
null_resource.users["gkoper"]: Refreshing state... [id=4428888515027379808]
null_resource.unattended-upgrades: Refreshing state... [id=8612788728500687848]
null_resource.sudoers["pierre"]: Refreshing state... [id=1490950273425897076]
null_resource.sudoers["michal"]: Refreshing state... [id=99097969114572076]
null_resource.users["leo"]: Refreshing state... [id=4801244393038155686]
null_resource.users["bertie"]: Refreshing state... [id=4823894494073022599]
null_resource.users["darmach"]: Refreshing state... [id=966428928526747769]
null_resource.users["matta"]: Refreshing state... [id=2788010242285589376]
null_resource.users["gavin"]: Refreshing state... [id=1450751086601337788]
null_resource.users["will"]: Refreshing state... [id=73784427677861605]
null_resource.users["rav"]: Refreshing state... [id=1708715813271030340]
null_resource.users["steveb"]: Refreshing state... [id=8581668554807089077]
null_resource.users["scott"]: Refreshing state... [id=3535944930733559393]
null_resource.users["michal"]: Refreshing state... [id=374198548753008845]
null_resource.users["dawud"]: Refreshing state... [id=4546220744260690111]
null_resource.users["gbialas"]: Refreshing state... [id=3291323943259894875]
null_resource.users["maxn"]: Refreshing state... [id=1787193289193230341]
null_resource.users["alex"]: Refreshing state... [id=778751542658455888]
null_resource.users["jack"]: Refreshing state... [id=9030225448453648851]
null_resource.users["bartosz"]: Refreshing state... [id=3337706271940199809]
null_resource.users["johng"]: Refreshing state... [id=5241014985690122797]
null_resource.users["slurm-app-ci"]: Refreshing state... [id=1175446419239916483]
null_resource.users["piotr"]: Refreshing state... [id=2399222675277566340]
null_resource.users["seunghun"]: Refreshing state... [id=522362072242318503]
null_resource.users["willt"]: Refreshing state... [id=7375706774500298503]
null_resource.users["stig"]: Refreshing state... [id=8049218557206307208]
null_resource.users["mattc"]: Refreshing state... [id=3768200010079431364]
null_resource.users["doug"]: Refreshing state... [id=8009177542837690121]
null_resource.users["jasleen"]: Refreshing state... [id=4223787972841272268]
null_resource.users["pierre"]: Refreshing state... [id=8595079508544267678]
null_resource.users["max"]: Refreshing state... [id=3400847105375144002]
null_resource.users["jake"]: Refreshing state... [id=6420115803194036988]
null_resource.users["axel"]: Refreshing state... [id=3227312829992314776]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # openstack_networking_floatingip_associate_v2.bastion has been deleted
  - resource "openstack_networking_floatingip_associate_v2" "bastion" {
      - floating_ip = "185.45.78.150" -> null
        id          = "7add4753-66f1-4edb-ac65-489aa92400db"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # null_resource.users["raine"] will be created
  + resource "null_resource" "users" {
      + id       = (known after apply)
      + triggers = {
          + "authorized_keys" = <<-EOT
                sk-ssh-ed25519@openssh.com AAAAGnNrLXNzaC1lZDI1NTE5QG9wZW5zc2guY29tAAAAIH8xm2uKK9Jz8r7/EsZ/MHCD2Iq5J1bgFz51/Cso0LCMAAAABHNzaDo= Raine1 StackHPC key - 2025-06-16
                sk-ssh-ed25519@openssh.com AAAAGnNrLXNzaC1lZDI1NTE5QG9wZW5zc2guY29tAAAAIE8eu1wubyEDuW9o8pmFEjdaUlB6yPs07GJo7RsQjO4LAAAABHNzaDo= Raine0 StackHPC key - 2025-06-16
            EOT
          + "host"            = "185.45.78.150"
          + "instance"        = "70958c53-1c25-4867-9329-64e55c51a8cb"
          + "private_key"     = (sensitive value)
          + "user"            = "ubuntu"
        }
    }

  # openstack_networking_floatingip_associate_v2.bastion will be created
  + resource "openstack_networking_floatingip_associate_v2" "bastion" {
      + fixed_ip    = (known after apply)
      + floating_ip = "185.45.78.150"
      + id          = (known after apply)
      + port_id     = "96653605-49d7-4121-bbeb-7c9acfd52e01"
      + region      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ users = [
        # (21 unchanged elements hidden)
        "piotr",
      + "raine",
        "rav",
        # (7 unchanged elements hidden)
    ]
```

</details>

#### Author ✍️@CloudyBug